// Çàãîëîâîê
#include <iostream>   
// îïðåäåëåíèå ïðîñòðàíñòâà èìåí, â êîòîðîì åñòü cout<<
using namespace std;
// Ãëàâíàÿ ôóíêöèÿ
int main()
{
	/* Ñëåäóþùàÿ êîìàíäà ÷åðåç 4 òàáóëÿöèè âûâîäèò òåêñò
	 Escape Sequences è ïåðåâîäèò âûâîä íà ñëåäóþùóþ
	 ñòðîêó
	*/
	cout << "\t\t\t\tEscape Sequences\n";
	// Âûâîäèò ïóñòóþ ñòðî÷êó
	cout << "\n";
	/* ×åðåç 2 òàáóëÿöèè âûâîäèò òåêñò \b, è åùå ÷åðåç
	 1 òàáóëÿöèþ Backspace Çàòåì \n ïåðåâîäèò âûâîä íà
	 ñëåäóþùóþ ñòðîêó
	*/
	cout << "\t\t\\b" << "\tBackspace\n";
	// Âûâîäèò ïóñòóþ ñòðîêó
	cout << "\n";
	/* ×åðåç 2 òàáóëÿöèè âûâîäèò òåêñò \n, è åùå ÷åðåç
	 1 òàáóëÿöèþ New line
	 Çàòåì \n ïåðåâîäèò âûâîä íà ñëåäóþùóþ ñòðîêó
	*/
	cout << "\t\t\\n" << "\tNew line\n";
	// Âûâîäèò ïóñòóþ ñòðîêó
	cout << "\n";
	/* ×åðåç 2 òàáóëÿöèè âûâîäèò òåêñò \t, è åùå ÷åðåç
	 1 òàáóëÿöèþ Horizontal tab Çàòåì \n ïåðåâîäèò
	 âûâîä íà ñëåäóþùóþ ñòðîêó
	*/
	cout << "\t\t\\t" << "\tHorizontal tab\n";
	// Âûâîäèò ïóñòóþ ñòðîêó
	cout << "\n";
		/* ×åðåç 2 òàáóëÿöèè âûâîäèò òåêñò \\, è åùå ÷åðåç
		 1 òàáóëÿöèþ Backslash \
		 Çàòåì \n ïåðåâîäèò âûâîä íà ñëåäóþùóþ ñòðîêó
		*/
		cout << "\t\t\\\\" << "\tBackslash \\\n";
	// Âûâîäèò ïóñòóþ ñòðîêó
	cout << "\n";
	/* ×åðåç 2 òàáóëÿöèè âûâîäèò òåêñò \t,
	 è åùå ÷åðåç 1 òàáóëÿöèþ Double quotation mark "
	 Çàòåì \n ïåðåâîäèò âûâîä íà ñëåäóþùóþ ñòðîêó
	*/
	cout << "\t\t\"" << "\tDouble quotation mark \"\n";
	// Âûâîäèò ïóñòóþ ñòðîêó
	cout << "\n";
	/* ×åðåç 2 òàáóëÿöèè âûâîäèò òåêñò \',
	 è åùå ÷åðåç 1 òàáóëÿöèþ Single quotation mark '
	 Çàòåì \n ïåðåâîäèò âûâîä íà ñëåäóþùóþ ñòðîêó
	*/
	cout << "\t\t\'" << "\tSingle quotation mark \'\n";
	// Âûâîäèò ïóñòóþ ñòðîêó
	cout << "\n";

	return 0;

}
